case/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 377.3364712030895;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 377.3364712030895;
    }

    outlet
    {
        type            zeroGradient;
    }

    wall
    {
        type            epsilonWallFunction;
        value           uniform 377.3364712030895;
    }

}

// ************************************************************************* //
