case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          1184;
        startFace       349132;
    }
    outlet
    {
        type            patch;
        nFaces          1184;
        startFace       350316;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          296;
        startFace       351500;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          350464;
        startFace       351796;
    }
)

// ************************************************************************* //
