case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Nozzle-conforming mesh generated from geometry

convertToMeters 1;

vertices
(
    (0.000000   -0.300000   0.0)   // 0
    (1.500000   -0.250000   0.0)   // 1
    (1.500000   0.250000   0.0)   // 2
    (0.000000   0.300000   0.0)   // 3
    (0.000000   -0.300000   0.1)   // 4
    (1.500000   -0.250000   0.1)   // 5
    (1.500000   0.250000   0.1)   // 6
    (0.000000   0.300000   0.1)   // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (148 1184 1) simpleGrading (1 1 1)
);

edges
(
        spline 0 1
        (
            (0.010204 -0.297584 0.0)
            (0.020408 -0.295099 0.0)
            (0.030612 -0.292545 0.0)
            (0.040816 -0.289921 0.0)
            (0.051020 -0.287228 0.0)
            (0.061224 -0.284465 0.0)
            (0.071429 -0.281633 0.0)
            (0.081633 -0.278731 0.0)
            (0.091837 -0.275760 0.0)
            (0.102041 -0.272720 0.0)
            (0.112245 -0.269610 0.0)
            (0.122449 -0.266431 0.0)
            (0.132653 -0.263182 0.0)
            (0.142857 -0.259864 0.0)
            (0.153061 -0.256476 0.0)
            (0.163265 -0.253020 0.0)
            (0.173469 -0.249493 0.0)
            (0.183673 -0.245898 0.0)
            (0.193878 -0.242232 0.0)
            (0.204082 -0.238498 0.0)
            (0.214286 -0.234694 0.0)
            (0.224490 -0.230820 0.0)
            (0.234694 -0.226878 0.0)
            (0.244898 -0.222865 0.0)
            (0.255102 -0.218784 0.0)
            (0.265306 -0.214633 0.0)
            (0.275510 -0.210412 0.0)
            (0.285714 -0.206122 0.0)
            (0.295918 -0.201763 0.0)
            (0.306122 -0.197334 0.0)
            (0.316327 -0.192836 0.0)
            (0.326531 -0.188269 0.0)
            (0.336735 -0.183632 0.0)
            (0.346939 -0.178925 0.0)
            (0.357143 -0.174150 0.0)
            (0.367347 -0.169304 0.0)
            (0.377551 -0.164390 0.0)
            (0.387755 -0.159406 0.0)
            (0.397959 -0.154352 0.0)
            (0.408163 -0.149229 0.0)
            (0.418367 -0.144037 0.0)
            (0.428571 -0.138776 0.0)
            (0.438776 -0.133444 0.0)
            (0.448980 -0.128044 0.0)
            (0.459184 -0.122574 0.0)
            (0.469388 -0.117035 0.0)
            (0.479592 -0.111426 0.0)
            (0.489796 -0.105748 0.0)
            (0.500000 -0.100000 0.0)
            (0.510204 -0.092618 0.0)
            (0.520408 -0.085735 0.0)
            (0.530612 -0.079394 0.0)
            (0.540816 -0.073553 0.0)
            (0.551020 -0.068253 0.0)
            (0.561224 -0.063453 0.0)
            (0.571429 -0.059194 0.0)
            (0.581633 -0.055435 0.0)
            (0.591837 -0.052218 0.0)
            (0.602041 -0.049500 0.0)
            (0.612245 -0.047324 0.0)
            (0.622449 -0.045648 0.0)
            (0.632653 -0.044513 0.0)
            (0.642857 -0.043878 0.0)
            (0.653061 -0.043784 0.0)
            (0.663265 -0.044190 0.0)
            (0.673469 -0.045137 0.0)
            (0.683673 -0.046585 0.0)
            (0.693878 -0.048574 0.0)
            (0.704082 -0.051554 0.0)
            (0.714286 -0.055437 0.0)
            (0.724490 -0.059277 0.0)
            (0.734694 -0.063094 0.0)
            (0.744898 -0.066867 0.0)
            (0.755102 -0.070606 0.0)
            (0.765306 -0.074323 0.0)
            (0.775510 -0.077985 0.0)
            (0.785714 -0.081624 0.0)
            (0.795918 -0.085230 0.0)
            (0.806122 -0.088792 0.0)
            (0.816327 -0.092332 0.0)
            (0.826531 -0.095827 0.0)
            (0.836735 -0.099288 0.0)
            (0.846939 -0.102728 0.0)
            (0.857143 -0.106112 0.0)
            (0.867347 -0.109474 0.0)
            (0.877551 -0.112802 0.0)
            (0.887755 -0.116086 0.0)
            (0.897959 -0.119348 0.0)
            (0.908163 -0.122566 0.0)
            (0.918367 -0.125750 0.0)
            (0.928571 -0.128912 0.0)
            (0.938776 -0.132018 0.0)
            (0.948980 -0.135102 0.0)
            (0.959184 -0.138153 0.0)
            (0.969388 -0.141159 0.0)
            (0.979592 -0.144143 0.0)
            (0.989796 -0.147083 0.0)
            (1.000000 -0.149990 0.0)
            (1.010204 -0.152874 0.0)
            (1.020408 -0.155702 0.0)
            (1.030612 -0.158509 0.0)
            (1.040816 -0.161282 0.0)
            (1.051020 -0.164011 0.0)
            (1.061224 -0.166717 0.0)
            (1.071429 -0.169379 0.0)
            (1.081633 -0.172008 0.0)
            (1.091837 -0.174615 0.0)
            (1.102041 -0.177166 0.0)
            (1.112245 -0.179695 0.0)
            (1.122449 -0.182190 0.0)
            (1.132653 -0.184641 0.0)
            (1.142857 -0.187070 0.0)
            (1.153061 -0.189454 0.0)
            (1.163265 -0.191805 0.0)
            (1.173469 -0.194134 0.0)
            (1.183673 -0.196408 0.0)
            (1.193878 -0.198659 0.0)
            (1.204082 -0.200877 0.0)
            (1.214286 -0.203050 0.0)
            (1.224490 -0.205201 0.0)
            (1.234694 -0.207308 0.0)
            (1.244898 -0.209382 0.0)
            (1.255102 -0.211433 0.0)
            (1.265306 -0.213428 0.0)
            (1.275510 -0.215402 0.0)
            (1.285714 -0.217342 0.0)
            (1.295918 -0.219238 0.0)
            (1.306122 -0.221111 0.0)
            (1.316327 -0.222940 0.0)
            (1.326531 -0.224736 0.0)
            (1.336735 -0.226510 0.0)
            (1.346939 -0.228228 0.0)
            (1.357143 -0.229924 0.0)
            (1.367347 -0.231586 0.0)
            (1.377551 -0.233204 0.0)
            (1.387755 -0.234800 0.0)
            (1.397959 -0.236352 0.0)
            (1.408163 -0.237870 0.0)
            (1.418367 -0.239366 0.0)
            (1.428571 -0.240806 0.0)
            (1.438776 -0.242224 0.0)
            (1.448980 -0.243609 0.0)
            (1.459184 -0.244949 0.0)
            (1.469388 -0.246268 0.0)
            (1.479592 -0.247541 0.0)
            (1.489796 -0.248782 0.0)
        )
        spline 3 2
        (
            (0.010204 0.297584 0.0)
            (0.020408 0.295099 0.0)
            (0.030612 0.292545 0.0)
            (0.040816 0.289921 0.0)
            (0.051020 0.287228 0.0)
            (0.061224 0.284465 0.0)
            (0.071429 0.281633 0.0)
            (0.081633 0.278731 0.0)
            (0.091837 0.275760 0.0)
            (0.102041 0.272720 0.0)
            (0.112245 0.269610 0.0)
            (0.122449 0.266431 0.0)
            (0.132653 0.263182 0.0)
            (0.142857 0.259864 0.0)
            (0.153061 0.256476 0.0)
            (0.163265 0.253020 0.0)
            (0.173469 0.249493 0.0)
            (0.183673 0.245898 0.0)
            (0.193878 0.242232 0.0)
            (0.204082 0.238498 0.0)
            (0.214286 0.234694 0.0)
            (0.224490 0.230820 0.0)
            (0.234694 0.226878 0.0)
            (0.244898 0.222865 0.0)
            (0.255102 0.218784 0.0)
            (0.265306 0.214633 0.0)
            (0.275510 0.210412 0.0)
            (0.285714 0.206122 0.0)
            (0.295918 0.201763 0.0)
            (0.306122 0.197334 0.0)
            (0.316327 0.192836 0.0)
            (0.326531 0.188269 0.0)
            (0.336735 0.183632 0.0)
            (0.346939 0.178925 0.0)
            (0.357143 0.174150 0.0)
            (0.367347 0.169304 0.0)
            (0.377551 0.164390 0.0)
            (0.387755 0.159406 0.0)
            (0.397959 0.154352 0.0)
            (0.408163 0.149229 0.0)
            (0.418367 0.144037 0.0)
            (0.428571 0.138776 0.0)
            (0.438776 0.133444 0.0)
            (0.448980 0.128044 0.0)
            (0.459184 0.122574 0.0)
            (0.469388 0.117035 0.0)
            (0.479592 0.111426 0.0)
            (0.489796 0.105748 0.0)
            (0.500000 0.100000 0.0)
            (0.510204 0.092618 0.0)
            (0.520408 0.085735 0.0)
            (0.530612 0.079394 0.0)
            (0.540816 0.073553 0.0)
            (0.551020 0.068253 0.0)
            (0.561224 0.063453 0.0)
            (0.571429 0.059194 0.0)
            (0.581633 0.055435 0.0)
            (0.591837 0.052218 0.0)
            (0.602041 0.049500 0.0)
            (0.612245 0.047324 0.0)
            (0.622449 0.045648 0.0)
            (0.632653 0.044513 0.0)
            (0.642857 0.043878 0.0)
            (0.653061 0.043784 0.0)
            (0.663265 0.044190 0.0)
            (0.673469 0.045137 0.0)
            (0.683673 0.046585 0.0)
            (0.693878 0.048574 0.0)
            (0.704082 0.051554 0.0)
            (0.714286 0.055437 0.0)
            (0.724490 0.059277 0.0)
            (0.734694 0.063094 0.0)
            (0.744898 0.066867 0.0)
            (0.755102 0.070606 0.0)
            (0.765306 0.074323 0.0)
            (0.775510 0.077985 0.0)
            (0.785714 0.081624 0.0)
            (0.795918 0.085230 0.0)
            (0.806122 0.088792 0.0)
            (0.816327 0.092332 0.0)
            (0.826531 0.095827 0.0)
            (0.836735 0.099288 0.0)
            (0.846939 0.102728 0.0)
            (0.857143 0.106112 0.0)
            (0.867347 0.109474 0.0)
            (0.877551 0.112802 0.0)
            (0.887755 0.116086 0.0)
            (0.897959 0.119348 0.0)
            (0.908163 0.122566 0.0)
            (0.918367 0.125750 0.0)
            (0.928571 0.128912 0.0)
            (0.938776 0.132018 0.0)
            (0.948980 0.135102 0.0)
            (0.959184 0.138153 0.0)
            (0.969388 0.141159 0.0)
            (0.979592 0.144143 0.0)
            (0.989796 0.147083 0.0)
            (1.000000 0.149990 0.0)
            (1.010204 0.152874 0.0)
            (1.020408 0.155702 0.0)
            (1.030612 0.158509 0.0)
            (1.040816 0.161282 0.0)
            (1.051020 0.164011 0.0)
            (1.061224 0.166717 0.0)
            (1.071429 0.169379 0.0)
            (1.081633 0.172008 0.0)
            (1.091837 0.174615 0.0)
            (1.102041 0.177166 0.0)
            (1.112245 0.179695 0.0)
            (1.122449 0.182190 0.0)
            (1.132653 0.184641 0.0)
            (1.142857 0.187070 0.0)
            (1.153061 0.189454 0.0)
            (1.163265 0.191805 0.0)
            (1.173469 0.194134 0.0)
            (1.183673 0.196408 0.0)
            (1.193878 0.198659 0.0)
            (1.204082 0.200877 0.0)
            (1.214286 0.203050 0.0)
            (1.224490 0.205201 0.0)
            (1.234694 0.207308 0.0)
            (1.244898 0.209382 0.0)
            (1.255102 0.211433 0.0)
            (1.265306 0.213428 0.0)
            (1.275510 0.215402 0.0)
            (1.285714 0.217342 0.0)
            (1.295918 0.219238 0.0)
            (1.306122 0.221111 0.0)
            (1.316327 0.222940 0.0)
            (1.326531 0.224736 0.0)
            (1.336735 0.226510 0.0)
            (1.346939 0.228228 0.0)
            (1.357143 0.229924 0.0)
            (1.367347 0.231586 0.0)
            (1.377551 0.233204 0.0)
            (1.387755 0.234800 0.0)
            (1.397959 0.236352 0.0)
            (1.408163 0.237870 0.0)
            (1.418367 0.239366 0.0)
            (1.428571 0.240806 0.0)
            (1.438776 0.242224 0.0)
            (1.448980 0.243609 0.0)
            (1.459184 0.244949 0.0)
            (1.469388 0.246268 0.0)
            (1.479592 0.247541 0.0)
            (1.489796 0.248782 0.0)
        )
        spline 4 5
        (
            (0.010204 -0.297584 0.1)
            (0.020408 -0.295099 0.1)
            (0.030612 -0.292545 0.1)
            (0.040816 -0.289921 0.1)
            (0.051020 -0.287228 0.1)
            (0.061224 -0.284465 0.1)
            (0.071429 -0.281633 0.1)
            (0.081633 -0.278731 0.1)
            (0.091837 -0.275760 0.1)
            (0.102041 -0.272720 0.1)
            (0.112245 -0.269610 0.1)
            (0.122449 -0.266431 0.1)
            (0.132653 -0.263182 0.1)
            (0.142857 -0.259864 0.1)
            (0.153061 -0.256476 0.1)
            (0.163265 -0.253020 0.1)
            (0.173469 -0.249493 0.1)
            (0.183673 -0.245898 0.1)
            (0.193878 -0.242232 0.1)
            (0.204082 -0.238498 0.1)
            (0.214286 -0.234694 0.1)
            (0.224490 -0.230820 0.1)
            (0.234694 -0.226878 0.1)
            (0.244898 -0.222865 0.1)
            (0.255102 -0.218784 0.1)
            (0.265306 -0.214633 0.1)
            (0.275510 -0.210412 0.1)
            (0.285714 -0.206122 0.1)
            (0.295918 -0.201763 0.1)
            (0.306122 -0.197334 0.1)
            (0.316327 -0.192836 0.1)
            (0.326531 -0.188269 0.1)
            (0.336735 -0.183632 0.1)
            (0.346939 -0.178925 0.1)
            (0.357143 -0.174150 0.1)
            (0.367347 -0.169304 0.1)
            (0.377551 -0.164390 0.1)
            (0.387755 -0.159406 0.1)
            (0.397959 -0.154352 0.1)
            (0.408163 -0.149229 0.1)
            (0.418367 -0.144037 0.1)
            (0.428571 -0.138776 0.1)
            (0.438776 -0.133444 0.1)
            (0.448980 -0.128044 0.1)
            (0.459184 -0.122574 0.1)
            (0.469388 -0.117035 0.1)
            (0.479592 -0.111426 0.1)
            (0.489796 -0.105748 0.1)
            (0.500000 -0.100000 0.1)
            (0.510204 -0.092618 0.1)
            (0.520408 -0.085735 0.1)
            (0.530612 -0.079394 0.1)
            (0.540816 -0.073553 0.1)
            (0.551020 -0.068253 0.1)
            (0.561224 -0.063453 0.1)
            (0.571429 -0.059194 0.1)
            (0.581633 -0.055435 0.1)
            (0.591837 -0.052218 0.1)
            (0.602041 -0.049500 0.1)
            (0.612245 -0.047324 0.1)
            (0.622449 -0.045648 0.1)
            (0.632653 -0.044513 0.1)
            (0.642857 -0.043878 0.1)
            (0.653061 -0.043784 0.1)
            (0.663265 -0.044190 0.1)
            (0.673469 -0.045137 0.1)
            (0.683673 -0.046585 0.1)
            (0.693878 -0.048574 0.1)
            (0.704082 -0.051554 0.1)
            (0.714286 -0.055437 0.1)
            (0.724490 -0.059277 0.1)
            (0.734694 -0.063094 0.1)
            (0.744898 -0.066867 0.1)
            (0.755102 -0.070606 0.1)
            (0.765306 -0.074323 0.1)
            (0.775510 -0.077985 0.1)
            (0.785714 -0.081624 0.1)
            (0.795918 -0.085230 0.1)
            (0.806122 -0.088792 0.1)
            (0.816327 -0.092332 0.1)
            (0.826531 -0.095827 0.1)
            (0.836735 -0.099288 0.1)
            (0.846939 -0.102728 0.1)
            (0.857143 -0.106112 0.1)
            (0.867347 -0.109474 0.1)
            (0.877551 -0.112802 0.1)
            (0.887755 -0.116086 0.1)
            (0.897959 -0.119348 0.1)
            (0.908163 -0.122566 0.1)
            (0.918367 -0.125750 0.1)
            (0.928571 -0.128912 0.1)
            (0.938776 -0.132018 0.1)
            (0.948980 -0.135102 0.1)
            (0.959184 -0.138153 0.1)
            (0.969388 -0.141159 0.1)
            (0.979592 -0.144143 0.1)
            (0.989796 -0.147083 0.1)
            (1.000000 -0.149990 0.1)
            (1.010204 -0.152874 0.1)
            (1.020408 -0.155702 0.1)
            (1.030612 -0.158509 0.1)
            (1.040816 -0.161282 0.1)
            (1.051020 -0.164011 0.1)
            (1.061224 -0.166717 0.1)
            (1.071429 -0.169379 0.1)
            (1.081633 -0.172008 0.1)
            (1.091837 -0.174615 0.1)
            (1.102041 -0.177166 0.1)
            (1.112245 -0.179695 0.1)
            (1.122449 -0.182190 0.1)
            (1.132653 -0.184641 0.1)
            (1.142857 -0.187070 0.1)
            (1.153061 -0.189454 0.1)
            (1.163265 -0.191805 0.1)
            (1.173469 -0.194134 0.1)
            (1.183673 -0.196408 0.1)
            (1.193878 -0.198659 0.1)
            (1.204082 -0.200877 0.1)
            (1.214286 -0.203050 0.1)
            (1.224490 -0.205201 0.1)
            (1.234694 -0.207308 0.1)
            (1.244898 -0.209382 0.1)
            (1.255102 -0.211433 0.1)
            (1.265306 -0.213428 0.1)
            (1.275510 -0.215402 0.1)
            (1.285714 -0.217342 0.1)
            (1.295918 -0.219238 0.1)
            (1.306122 -0.221111 0.1)
            (1.316327 -0.222940 0.1)
            (1.326531 -0.224736 0.1)
            (1.336735 -0.226510 0.1)
            (1.346939 -0.228228 0.1)
            (1.357143 -0.229924 0.1)
            (1.367347 -0.231586 0.1)
            (1.377551 -0.233204 0.1)
            (1.387755 -0.234800 0.1)
            (1.397959 -0.236352 0.1)
            (1.408163 -0.237870 0.1)
            (1.418367 -0.239366 0.1)
            (1.428571 -0.240806 0.1)
            (1.438776 -0.242224 0.1)
            (1.448980 -0.243609 0.1)
            (1.459184 -0.244949 0.1)
            (1.469388 -0.246268 0.1)
            (1.479592 -0.247541 0.1)
            (1.489796 -0.248782 0.1)
        )
        spline 7 6
        (
            (0.010204 0.297584 0.1)
            (0.020408 0.295099 0.1)
            (0.030612 0.292545 0.1)
            (0.040816 0.289921 0.1)
            (0.051020 0.287228 0.1)
            (0.061224 0.284465 0.1)
            (0.071429 0.281633 0.1)
            (0.081633 0.278731 0.1)
            (0.091837 0.275760 0.1)
            (0.102041 0.272720 0.1)
            (0.112245 0.269610 0.1)
            (0.122449 0.266431 0.1)
            (0.132653 0.263182 0.1)
            (0.142857 0.259864 0.1)
            (0.153061 0.256476 0.1)
            (0.163265 0.253020 0.1)
            (0.173469 0.249493 0.1)
            (0.183673 0.245898 0.1)
            (0.193878 0.242232 0.1)
            (0.204082 0.238498 0.1)
            (0.214286 0.234694 0.1)
            (0.224490 0.230820 0.1)
            (0.234694 0.226878 0.1)
            (0.244898 0.222865 0.1)
            (0.255102 0.218784 0.1)
            (0.265306 0.214633 0.1)
            (0.275510 0.210412 0.1)
            (0.285714 0.206122 0.1)
            (0.295918 0.201763 0.1)
            (0.306122 0.197334 0.1)
            (0.316327 0.192836 0.1)
            (0.326531 0.188269 0.1)
            (0.336735 0.183632 0.1)
            (0.346939 0.178925 0.1)
            (0.357143 0.174150 0.1)
            (0.367347 0.169304 0.1)
            (0.377551 0.164390 0.1)
            (0.387755 0.159406 0.1)
            (0.397959 0.154352 0.1)
            (0.408163 0.149229 0.1)
            (0.418367 0.144037 0.1)
            (0.428571 0.138776 0.1)
            (0.438776 0.133444 0.1)
            (0.448980 0.128044 0.1)
            (0.459184 0.122574 0.1)
            (0.469388 0.117035 0.1)
            (0.479592 0.111426 0.1)
            (0.489796 0.105748 0.1)
            (0.500000 0.100000 0.1)
            (0.510204 0.092618 0.1)
            (0.520408 0.085735 0.1)
            (0.530612 0.079394 0.1)
            (0.540816 0.073553 0.1)
            (0.551020 0.068253 0.1)
            (0.561224 0.063453 0.1)
            (0.571429 0.059194 0.1)
            (0.581633 0.055435 0.1)
            (0.591837 0.052218 0.1)
            (0.602041 0.049500 0.1)
            (0.612245 0.047324 0.1)
            (0.622449 0.045648 0.1)
            (0.632653 0.044513 0.1)
            (0.642857 0.043878 0.1)
            (0.653061 0.043784 0.1)
            (0.663265 0.044190 0.1)
            (0.673469 0.045137 0.1)
            (0.683673 0.046585 0.1)
            (0.693878 0.048574 0.1)
            (0.704082 0.051554 0.1)
            (0.714286 0.055437 0.1)
            (0.724490 0.059277 0.1)
            (0.734694 0.063094 0.1)
            (0.744898 0.066867 0.1)
            (0.755102 0.070606 0.1)
            (0.765306 0.074323 0.1)
            (0.775510 0.077985 0.1)
            (0.785714 0.081624 0.1)
            (0.795918 0.085230 0.1)
            (0.806122 0.088792 0.1)
            (0.816327 0.092332 0.1)
            (0.826531 0.095827 0.1)
            (0.836735 0.099288 0.1)
            (0.846939 0.102728 0.1)
            (0.857143 0.106112 0.1)
            (0.867347 0.109474 0.1)
            (0.877551 0.112802 0.1)
            (0.887755 0.116086 0.1)
            (0.897959 0.119348 0.1)
            (0.908163 0.122566 0.1)
            (0.918367 0.125750 0.1)
            (0.928571 0.128912 0.1)
            (0.938776 0.132018 0.1)
            (0.948980 0.135102 0.1)
            (0.959184 0.138153 0.1)
            (0.969388 0.141159 0.1)
            (0.979592 0.144143 0.1)
            (0.989796 0.147083 0.1)
            (1.000000 0.149990 0.1)
            (1.010204 0.152874 0.1)
            (1.020408 0.155702 0.1)
            (1.030612 0.158509 0.1)
            (1.040816 0.161282 0.1)
            (1.051020 0.164011 0.1)
            (1.061224 0.166717 0.1)
            (1.071429 0.169379 0.1)
            (1.081633 0.172008 0.1)
            (1.091837 0.174615 0.1)
            (1.102041 0.177166 0.1)
            (1.112245 0.179695 0.1)
            (1.122449 0.182190 0.1)
            (1.132653 0.184641 0.1)
            (1.142857 0.187070 0.1)
            (1.153061 0.189454 0.1)
            (1.163265 0.191805 0.1)
            (1.173469 0.194134 0.1)
            (1.183673 0.196408 0.1)
            (1.193878 0.198659 0.1)
            (1.204082 0.200877 0.1)
            (1.214286 0.203050 0.1)
            (1.224490 0.205201 0.1)
            (1.234694 0.207308 0.1)
            (1.244898 0.209382 0.1)
            (1.255102 0.211433 0.1)
            (1.265306 0.213428 0.1)
            (1.275510 0.215402 0.1)
            (1.285714 0.217342 0.1)
            (1.295918 0.219238 0.1)
            (1.306122 0.221111 0.1)
            (1.316327 0.222940 0.1)
            (1.326531 0.224736 0.1)
            (1.336735 0.226510 0.1)
            (1.346939 0.228228 0.1)
            (1.357143 0.229924 0.1)
            (1.367347 0.231586 0.1)
            (1.377551 0.233204 0.1)
            (1.387755 0.234800 0.1)
            (1.397959 0.236352 0.1)
            (1.408163 0.237870 0.1)
            (1.418367 0.239366 0.1)
            (1.428571 0.240806 0.1)
            (1.438776 0.242224 0.1)
            (1.448980 0.243609 0.1)
            (1.459184 0.244949 0.1)
            (1.469388 0.246268 0.1)
            (1.479592 0.247541 0.1)
            (1.489796 0.248782 0.1)
        )
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
